Autodesk.Revit.DB.IndependentTag.GetTaggedReference
Get the host reference of the tag.
Remarks:
The reference can be to an element or subelement in a local or linked document.
Since:
2018

Autodesk.Revit.DB.IndependentTag.IsTaggedOnSubelement
Returns true if the tag is tagged on a subelement.
Since:
2018

Autodesk.Revit.DB.IndependentTag.CanLeaderEndConditionBeAssigned(Autodesk.Revit.DB.LeaderEndCondition)
Checks whether the LeaderEndCondition can be changed.
Remarks:
Material tags and material keynotes can only use the free end condition.
leaderEndCondition:
The leader end condition to check.
Returns:
True if the leader end condition of the tag can be assigned, or false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.GetTaggedLocalElement
Get the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element.
Returns:
The tagged element from the local document, or null for orphan tags and tagged elements in linked documents.

Autodesk.Revit.DB.IndependentTag.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Places a tag on an element or subelement.
document:
The document to which the tag will be added.
symId:
The id for the FamilySymbol which determines the tag's type.
ownerDBViewId:
The view in which the tag will be visible.
referenceToTag:
The host reference of the tag. The reference can be to an element or subelement in a local or linked document.
addLeader:
When true, the tag will be created with a straight leader with an attached end.
tagOrientation:
The orientation of the tag's head.
pnt:
For tags without leaders, this point is the position of the tag head.
For tags with leaders, this point is the end point of the leader, and a leader of default length will be created from this point to the tag head.
Returns:
If successful the new tag is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId ownerDBViewId does not correspond to a View.
-or-
The ElementId ownerDBViewId is a view template.
-or-
The ElementId ownerDBViewId is a perspective view.
-or-
The 3D view ownerDBViewId is not locked.
-or-
The ElementId symId does not correspond to a FamilySymbol.
-or-
The reference can not be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InternalException:
Tag creation failed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019

Autodesk.Revit.DB.IndependentTag.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Reference,System.Boolean,Autodesk.Revit.DB.TagMode,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.XYZ)
Places a tag on an element or subelement.
Remarks:
Single category tags, multi-category tags and material tags can be placed.
document:
The document to which the tag will be added.
ownerDBViewId:
The view in which the tag will be visible.
referenceToTag:
The host reference of the tag. The reference can be to an element or subelement in a local or linked document.
addLeader:
When true, the tag will be created with a straight leader with an attached end.
tagMode:
This argument determines the type of tag that will be created. Tag by category, multi-category tag, and material tag are allowed.
tagOrientation:
The orientation of the tag's head.
pnt:
For tags without leaders, this point is the position of the tag head.
For tags with leaders, this point is the end point of the leader, and a leader of default length will be created from this point to the tag head.
Returns:
If successful the new tag is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId ownerDBViewId does not correspond to a View.
-or-
The ElementId ownerDBViewId is a view template.
-or-
The ElementId ownerDBViewId is a perspective view.
-or-
The 3D view ownerDBViewId is not locked.
-or-
The reference can not be tagged.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InternalException:
Tag creation failed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no loaded tag type that can be used when tagging referenceToTag with tagMode.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.IndependentTag.LeaderEnd
The position of the leader end for a tag using free end leader behavior.
Remarks:
Tags with attached leaders or no leaders do not report leader ends.
Autodesk.Revit.DB.IndependentTag.LeaderEndCondition for the tag's leader condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader end because the tag does not use a free end leader.

Autodesk.Revit.DB.IndependentTag.LeaderElbow
The position of the elbow of the tag's leader.
Remarks:
Straight leaders do not have elbow points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tag does not have a leader or its leader is straight.
-or-
When setting this property: The tag does not have a leader.

Autodesk.Revit.DB.IndependentTag.LeaderEndCondition
The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
Remarks:
Autodesk.Revit.DB.LeaderEndCondition enumerates the supported leader end conditions.
Material tags and material keynotes can only use the free end condition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: LeaderEndCondition cannot be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.HasElbow
Whether the tag's leader has an elbow point or not.
Remarks:
Straight leaders do not have elbow points.  Autodesk.Revit.DB.IndependentTag.LeaderElbow.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tag does not have a leader.

Autodesk.Revit.DB.IndependentTag.HasLeader
Whether the tag has a leader or not.
True if the tag has a leader, or false otherwise.

Autodesk.Revit.DB.IndependentTag.TagHeadPosition
The position of the head of tag in model coordinates.
Remarks:
The depth of the tag head position in the view does not matter
because tags are drawn over model geometry in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.IndependentTag.TagOrientation
The tag orientation of the tag's head, such as horizontal or vertical.
Remarks:
Autodesk.Revit.DB.TagOrientation for the supported orientations.
Tags from types that have rotate with component turned on ignore the TagOrientation property.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.IndependentTag.TaggedLocalElementId
The ID of the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element ID.

Autodesk.Revit.DB.IndependentTag.IsOrphaned
Identifies if the tag is orphaned or not.
Remarks:
Orphaned tags are those tags that are associated with an instance of a linked Revit file but have no host element.
Tags become orphaned when the element they were tagging was deleted from the link.

Autodesk.Revit.DB.IndependentTag.IsMulticategoryTag
Identifies if it is a multi-category tag or not.

Autodesk.Revit.DB.IndependentTag.IsMaterialTag
Identifies if it is a material tag or not.

Autodesk.Revit.DB.IndependentTag.TagText
The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The tagging element is in the link.

Autodesk.Revit.DB.IndependentTag.TaggedElementId
The LinkElementId of the tagged element. If the tag is tagged on a subelement of linked element, it returns the LinkElementId of the element.
Remarks:
If there is no tagged element because the tag is orphaned, LinkElementId.HostElementId, LinkElementId.LinkElementId and LinkElementId.LinkInstanceId will be InvalidElementId.

Autodesk.Revit.DB.IndependentTag.MultiReferenceAnnotationId
The multi-reference annotation which owns this tag.
Remarks:
Autodesk::Revit::DB::MultiReferenceAnnotation for more information.

Autodesk.Revit.DB.IndependentTag
Represents tag annotations in Revit.
Remarks:
IndependentTag represents single-category tags, multi-category tags, material tags, and zone tags.
IndependentTag is also the base class for other annotations like keynote tags and span symbols.
Room, area and space tags are not derived from IndependentTag.  Autodesk::Revit::DB::SpatialElementTag for more information.